import React, { useState, useEffect } from "react";
import "../styles/About.css"



const IMAGE_ARRAY = ["/image1.jpg"];
export const About = (props) => {


//   const [index, setNumber] = useState(0);


//   useEffect(() => {
//     setInterval(() => setNumber(num => num + 1), 1000)
//   }, [])

  return (
    <div>

    <p class="title_about">?איך לעשות שמח</p>
    <div>.זה בדיוק מה ששאלתי את עצמי כשיצאתי מחדר הניתוח להתאוששות מגובס כולי וכואב אחרי תאונת דרכים קשה</div>
    <div>.השקט המתוח צרם לי באוזניים. מעין ענן כבד של מחשבות ודאגות מילא את האווירה ללא מילים</div>
    <div>.הימים עברו בלי שום שינוי, גיוון או מישהו שיבוא ויזכיר לרגע שיש עולם אחר חוץ מאשפוזים, כאבים תרופות ובדיקות</div>
    <div>.גם בשבתות בית החולים הרגיש עולם אחר. לא היו סעודות שבת, לא היתה אוירה של שבת.לא היו חלות על השולחן או שירים. היה חסר קצת טעם של בית</div>
    <div>.כשהשתחררתי ידעתי שהתשובה לשאלה "איך עושים שמח" נמצא בתוכי</div>
    <div>.ארגנתי כמה מתנדבים עם גיטרות כדי לנגן, לשיר, להישאר מעט ולהקשיב ללב גם בין המילים</div>
    <div>.מכאן זה הלך וגדל לארגון בפריסה ארצית בבתי החולים ומאות מתנדבים שמשמחים חולים עם מנגינות ושירים</div>
    <div>.זאת ועוד</div>
    <div>.עגלות הנתינה מתגלגלות במחלקות עם עוגות, מאפים טובים, שתיה חמה ומיצים טריים</div>
    <div>.אצל הילדים פתאום בורקות העיניים, כי מי זוכר את הדקירות של המחטים מול על המתוקים? ימבמבם, פופקורן, אייס קפה וכל מה שאוהבים</div>
    <div>.החלום מתגשם ובשבתות אוהל השמחה מלא באור, אווירה של שבת. השולחן ערוך ועמוס בסעודות עשירות ופינוקים, ויותר מ- 300 אנשים שלרגע שוכחים כמעט שהם בעצם חולים</div>
    <div>.המסירות של המתנדבים מפתיעה אותי בכל פעם מחדש. הם שומרים על החולים בשעות לא שגרתיות, דואגים לילדים ליצירות, להפעלות ולמסיבות</div>
    <div>.הם נמצאים שם, חווים איתם את הכאבים הגדולים וחוגגים איתם נצחונות קטנים</div>
    <div>.הם נמצאים שעות על הרגליים ומחלקים מרק חם למי שלא יכול לקום וללכת</div>
    <div>...ועל הדרך לא לנסות לחשוב על מה היה קורה אם לא</div>
    <div>,אם הילד היה ממשיך לשיר לבד לעצמו</div>
    <div>,אם עוד לחי קטנה היתה נשארת רטובה</div>
    <div>אם אותם הלבבות היו שוב נשברים</div>
    <div>כי הם היו מרגישים שקופים</div>
    <div>,בין טיפה של כימו לטיפת אינפוזיה</div>
    <div>,ורק מחכים לטיפת יחס לאור וחום</div>
    <div>...למישהו לדבר איתו, ואולי גם לשתוק</div>
    <div>,אז אנחנו פה כדי להיות קשת בים של עננים</div>
    <div>,לשיר, לנגן על מיתרי הלב להיות כשכואב</div>
    <div>...להעלות חיוך ושמחה לעשות כיף ואווירה טובה כי</div>
    <p class="sub_title">!באנו לעשות שמח</p>

    </div>
  )


}
// ================================================================================================
// import React, { useState } from "react";
// import "../styles/About.css"

// const ReadMore = ({ children }) => {
//   const text = children;
//   const [isReadMore, setIsReadMore] = useState(true);
//   const toggleReadMore = () => {
//     setIsReadMore(!isReadMore);
//   };
//   return (
//     <p className="text">
//       {isReadMore ? text.slice(0, 5) : text}
//       <span onClick={toggleReadMore} className="read-or-hide">
//         {isReadMore ? "...read more" : " show less"}
//       </span>
//     </p>
//   );
// };

// const Content = () => {
//   return (
//     <div className="container">
//       <h2>
//         <ReadMore>
//           <p class="title_about">?איך לעשות שמח</p>
//           <div>.זה בדיוק מה ששאלתי את עצמי כשיצאתי מחדר הניתוח להתאוששות מגובס כולי וכואב אחרי תאונת דרכים קשה</div>
//           <div>.השקט המתוח צרם לי באוזניים. מעין ענן כבד של מחשבות ודאגות מילא את האווירה ללא מילים</div>
//           <div>.הימים עברו בלי שום שינוי, גיוון או מישהו שיבוא ויזכיר לרגע שיש עולם אחר חוץ מאשפוזים, כאבים תרופות ובדיקות</div>
//           <div>.גם בשבתות בית החולים הרגיש עולם אחר. לא היו סעודות שבת, לא היתה אוירה של שבת. לא היו חלות על השולחן או שירים. היה חסר קצת טעם של בית</div>
//           <div>.כשהשתחררתי ידעתי שהתשובה לשאלה "איך עושים שמח" נמצא בתוכי</div>
//           <div>.ארגנתי כמה מתנדבים עם גיטרות כדי לנגן, לשיר, להישאר מעט ולהקשיב ללב גם בין המילים</div>
//           <div>.מכאן זה הלך וגדל לארגון בפריסה ארצית בבתי החולים ומאות מתנדבים שמשמחים חולים עם מנגינות ושירים</div>
//           <div>.זאת ועוד</div>
//           <div>.עגלות הנתינה מתגלגלות במחלקות עם עוגות, מאפים טובים, שתיה חמה ומיצים טריים</div>
//           <div>.אצל הילדים פתאום בורקות העיניים, כי מי זוכר את הדקירות של המחטים מול על המתוקים? ימבמבם, פופקורן, אייס קפה וכל מה שאוהבים</div>
//           <div>.החלום מתגשם ובשבתות אוהל השמחה מלא באור, אווירה של שבת. השולחן ערוך ועמוס בסעודות עשירות ופינוקים, ויותר מ- 300 אנשים שלרגע שוכחים כמעט שהם בעצם חולים</div>
//           <div>.המסירות של המתנדבים מפתיעה אותי בכל פעם מחדש. הם שומרים על החולים בשעות לא שגרתיות, דואגים לילדים ליצירות, להפעלות ולמסיבות</div>
//           <div>.הם נמצאים שם, חווים איתם את הכאבים הגדולים וחוגגים איתם נצחונות קטנים</div>
//           <div>.הם נמצאים שעות על הרגליים ומחלקים מרק חם למי שלא יכול לקום וללכת</div>
//           <div>...ועל הדרך לא לנסות לחשוב על מה היה קורה אם לא</div>
//           <div>,אם הילד היה ממשיך לשיר לבד לעצמו</div>
//           <div>,אם עוד לחי קטנה היתה נשארת רטובה</div>
//           <div>אם אותם הלבבות היו שוב נשברים</div>
//           <div>כי הם היו מרגישים שקופים</div>
//           <div>,בין טיפה של כימו לטיפת אינפוזיה</div>
//           <div>,ורק מחכים לטיפת יחס לאור וחום</div>
//           <div>...למישהו לדבר איתו, ואולי גם לשתוק</div>
//           <div>,אז אנחנו פה כדי להיות קשת בים של עננים</div>
//           <div>,לשיר, לנגן על מיתרי הלב להיות כשכואב</div>
//           <div>...להעלות חיוך ושמחה לעשות כיף ואווירה טובה כי</div>
//           <p class="sub_title">!באנו לעשות שמח</p>
//         </ReadMore>
//       </h2>
//     </div>
//   );
// };

// export default Content;
