import React, { useState, useEffect } from "react";
import "../styles/Donations.css"


const IMAGE_ARRAY = ["/image1.jpg"];
export const Donations = (props) => {

  const [index, setNumber] = useState(0);

  useEffect(() => {
    setInterval(() => setNumber(num => num + 1), 1000)
  }, [])

  return (
    <div>
      <h3>(סרגל כלים)</h3>
      <h1 className="title">תרומות</h1>
      <ul>
        <li className="de">שמחה</li>
      </ul>
      <ul>
        <li>התרומה שלך תוסיף להם</li>
      </ul>

      <p>?איך תרצו לתרום</p>

      {/* <ul>
        <li className="bitphone">053-237-5258</li>
      </ul>
      <ul>
        <li className="subtitle">-העברה באמצעות ביט/טלפון</li>
      </ul> */}


      <div className="link">
        <a href="https://office.kesherhk.info/Clearing.aspx?id=11458" target="_blank">הוראת קבע</a>
      </div>
      <div className="link">
        <a href="https://office.kesherhk.info/Clearing.aspx?id=8048" target="_blank">תרומה באשראי</a>
      </div>

      {/* <div className="bitphone">
      <p className="subtitle">:העברה באמצעות ביט/טלפון</p>
      </div>
      <div>
      <p>0532375258</p>
      </div>
       
       <p className="subtitle">:העברה בנקאית</p>
      <p>בנק מרכנתיל</p>
       <p>סניף 732</p>
      <p>מספר חשבון 82132</p>
      <p>ע״ש עמותת עושים שמח</p> */}

      {/* {number} */}
      {/* <img src={IMAGE_ARRAY[index]} /> */}



       
      {/* <p className="titleAbout">?איך לעשות שמח</p>

      <div className="bodyAbout">
        זה בדיוק מה ששאלתי את עצמי כשיצאתי מחדר הניתוח להתאוששות מגובס וכואב אחרי תאונת דרכים קשה.
        השקט המתוח צרם לי באוזניים, כאילו ענן כבד של מחשבות ודאגות מילא את האוויר בלי מילים.
        הימים עברו בלי שום שינוי, גיוון או מישהו שיבוא להזכיר לרגע שיש עולם אחר חוץ מאישפוזים, כאבים, תרופות ובדיקות.
        גם בשבתות הבית חולים הרגיש עולם אחר כאילו אין סעודות, אווירה, חלות, שירים, קצת טעם של בית. יותר נכון באמת אין.
        כשהשתחררתי ידעתי שהתשובה לשאלה איך עושים שמח נמצאת בי.
        אז ארגנתי כמה מתנדבים עם גיטרות ושירים כדי לנגן, לשיר, להישאר ולשמוע את הלב גם בין המילים.
        ומכאן זה רק הלך וגדל לארגון בפריסה ארצית בבתי חולים ומאות של מתנדבים שמשמחים חולים עם שירים ומנגינות, ולא רק, עגלות הנתינה מתגלגלות במחלקות עם עוגות, מאפים טובים, שתיה חמה ומיצים טריים.
        ואצל הילדים פתאום נדלקות העיניים כי מי זוכר את הדקירות של המחטים מול כל המתוקים? ימבמבם, פופקורן, אייס קפה וכל מה שאוהבים.
        החלום מתגשם ובשבתות אוהל השמחה מלא באור, באווירה, בשולחן מלא עם סעודות עשירות ופינוקים עם יותר מ300 אנשים שלרגע כמעט שוכחים שהם בעצם חולים.
        המסירות של המתנדבים מפתיעה אותי כל פעם מחדש, לשמור על חולים בשעות לא שעות, לדאוג לילדים ליצירות, הפעלות ומסיבות.
        להיות, לחוות את הכאבים הגדולים ולחגוג ניצחונות קטנים.
        למשוך שעות על הרגליים עם חלוקת מרק חם למי שלא יכול לקום וללכת ועל הדרך לנסות לא לחשוב על מה היה קורה אם לא...
        אם הילד היה ממשיך לשיר לבד בעצמו, אם עוד לחי קטנה היתה נשארת רטובה, אם אותם הלבבות היו שוב נשברים כי הם היו מרגישים שקופים,
        בין טיפה של כימו לטיפת אינפוזיה ורק מחכים לטיפת יחס, לאור וחום, למישהו לדבר איתו ואולי גם לשתוק.
        אז אנחנו כאן כדי להיות קשת בים של עננים, לשיר, לנגן על מיתרי הלב, להיות כשכואב, להעלות חיוך ושמחה ולעשות כיף ואווירה
      </div>

<p className="endAbout">!כי באנו לעשות שמח</p>  */}

    </div>




  )


}


